html/mac.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>mac</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="dirtysalt" />
<link rel="shortcut icon" href="/themes/favicon.ico" /><link rel="stylesheet" type="text/css" href="/themes/simple.css"/></head>
<body>
<div id="content">
<h1 class="title">mac</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. 软件列表</a></li>
<li><a href="#sec-2">2. 截屏操作</a></li>
<li><a href="#sec-3">3. 设置触控板</a></li>
<li><a href="#sec-4">4. 控制休眠</a></li>
<li><a href="#sec-5">5. VirtualBox启动问题</a></li>
<li><a href="#sec-6">6. 启动sshd服务</a></li>
<li><a href="#sec-7">7. 禁止iPhoto人脸检测功能</a></li>
</ul>
</div>
</div>
<p>
相对ubuntu来说，mac还是非常容易上手的。我相信同学的说法:"你拿到的是世界上最好的笔记本"。大部分时候我主要用它阅读文档和浏览网页，只是偶尔在上面写写代码（开发还是觉得在Linux/Ubuntu上好点）
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 软件列表</h2>
<div class="outline-text-2" id="text-1">
<p>
mac软件还是非常齐全的，我大致安装了下面这些东西。感觉brew可用软件并不是太多，常用软件都可以通过dmg找到。
</p>

<p>
下面软件是通过手动下载dmg安装的:
</p>
<ul class="org-ul">
<li>Evernote
</li>
<li>brew # apt-get on Mac.
</li>
<li>字典 # mac自带词典已经非常好用，并且附带了许多词库。在字典的偏好设置里面可以选择这些词库。可选的还有金山词霸，有道词典
</li>
<li>Tunnelblick # openvpn似乎在mac下面似乎有bug.
</li>
<li>VirtualBox
</li>
<li>Chrome
</li>
<li>IntelliJ(For Java) and PyCharm(For Python)
</li>
<li>AirServer # AirPlay Server. 这个其实用途不太大
</li>
<li>网盘 # 可选的有百度云盘，金山快盘（可以在Ubuntu上运行）。不过随着国内网盘纷纷关闭，最后还是切换回了DropBox
</li>
<li>音乐 # 可选的有百度音乐，网易云音乐
</li>
<li>Skype # 当然原生的Facetime也非常好用
</li>
<li>Alfred（最好购买Powerpack）
</li>
<li>iTerm2
</li>
<li>iWork # 比Office效果好多了
</li>
<li>QQ, 微信和企业微信
</li>
<li>Dash 开发文档检索工具，还可以和Alfred集成起来使用
</li>
</ul>

<p>
下面软件是通过brew自动安装的:
</p>
<ul class="org-ul">
<li># brew install openvpn # 翻墙代理
</li>
<li>brew install emacs &#x2013;cocoa &#x2013;srgb
<ul class="org-ul">
<li><a href="http://emacsformacosx.com/">http://emacsformacosx.com/</a> 从这里可以直接安装发行版本
</li>
<li><a href="https://emacsformacosx.com/emacs-builds/Emacs-24.5-universal.dmg">Emacs 24.5 on Max OS X</a> 我现在使用的是这个版本
</li>
</ul>
</li>
<li>brew install tmux
</li>
<li>brew install cscope
</li>
<li>brew install ctags
</li>
</ul>

<p>
brew的常用选项有下面这些：
</p>
<ul class="org-ul">
<li>brew search &lt;package&gt; # 搜索package
</li>
<li>brew install &lt;package&gt; # 安装package
</li>
<li>brew options &lt;package&gt; # 查看package安装选项
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 截屏操作</h2>
<div class="outline-text-2" id="text-2">
<p>
使用Command+Shift+4可以进行截屏，ESC可以退出，截图会保存在桌面上。
</p>

<p>
或者使用Command+Shift+Control+4进行截屏，完成后图片保存在剪切板上。
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> 设置触控板</h2>
<div class="outline-text-2" id="text-3">
<p>
系统偏好设置 =&gt; 触控板 =&gt; 设置"轻拍来点按". 不然每次左键都要用力按下.
</p>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> 控制休眠</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>系统偏好设置=》节能器
</li>
<li>电池模式下面使用默认配置
</li>
<li>电源适配器下面使用默认配置，然后修改”电脑进入睡眠“为”永不“
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> VirtualBox启动问题</h2>
<div class="outline-text-2" id="text-5">
<p>
启动遇到如下错误"VM (VERR_SUPLIB_WORLD_WRITABLE) with following details: code d'erreur: NS_ERROR_FAILURE (0x80004005) composant: console interface: IConsole {515e8e8d-f932-4d8e-9f32-79a52aead882}". 查看日志之后发现/Applications权限存在问题，修改权限到755之后正常启动。
</p>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> 启动sshd服务</h2>
<div class="outline-text-2" id="text-6">
<p>
系统偏好设置 -&gt; 共享 -&gt; 远程登陆
</p>
</div>
</div>

<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> 禁止iPhoto人脸检测功能</h2>
<div class="outline-text-2" id="text-7">
<p>
<a href="http://sullysrants.com/2014/02/disable-stoppause-iphoto-faces-detection/">http://sullysrants.com/2014/02/disable-stoppause-iphoto-faces-detection/</a>
</p>

<p>
defaults write com.apple.iPhoto PKFaceDetectionEnabled 0
</p>
</div>
</div>
</div>
</body>
</html>
